# // Кирки, лазание
# // Сделать воду
# // Стамина
# // Ресурсы
# // Вес
# // Магазин
# // Продажа ресурсов
# // Покупка Улучшений
# // Улучшение глубины
# // Интерфейс в магазине
# // Смерть от падения
# // Интерфейс стамины
# // Интерфейс веса
# // Интерфейс прицела
# // Интерфейс точки зацепа
# // Выпадение ресурсов
# -- TODO Ограничить лазание по потолку градусом
# TODO Комикс показывать в начале
# TODO Заканчивать игру после нахождения последнего предмета
# TODO Металлоискатель ( Для того чтобы искать последний предмет )
# // Расставить предметы
# // Выталкивать водой
#-- TODO Зацепы
# TODO Титры
# TODO Настроить значения ( баланс )


 # TODO Звуки
 # TODO Шейдеы
 # TODO Свет
 # TODO Интерфейс настроить стиль


# TODO звуки
#-- = сомнительно
#	хождения
#	прыжка
#	приземления
#	падения (в воздухе)
#	отсутствие стамины
#	-- звуки утставания (типо когда мало стамины)
#	зацепа
#	отцепа
#	поднятие предмета
#	поднятие предмета + перевес
#	положил предмет
#	звук включения сосателя 3000 (гул)
#	звук выключения сосателя 3000 (гул)
#	шреддера
#	траты денег
#	пополнения денег
#	звуки прилива
#	звуки отлива
#	когда упал в воду
#	звуки радара(металлоискатель)
#-- когда вода вытолкнула
