# // Кирки, лазание
# // Сделать воду
# // Стамина
# // Ресурсы
# // Вес
# // Магазин
# TODO Продажа ресурсов
# // Покупка Улучшений
# TODO Улучшение глубины
# TODO Интерфейс в магазине
# TODO Сдохность от падения
# TODO Интерфейс стамины
# TODO Интерфейс веса
# TODO Интерфейс прицела
# TODO Интерфейс точки зацепа
# TODO Ограничить лазание по потолку градусом
# TODO Комикс показывать в начале
# TODO Заканчивать игру после нахождения последнего предмета
# TODO Металлоискатель ( Для того чтобы искать последний предмет )
# TODO Расставить предметы
# TODO Выталкивать водой
# TODO Зацепы


 # TODO Звуки
 # TODO Шейдеы
 # TODO Свет
 # TODO Интерфейс настроить стиль
